<?php

return [

    /*
    |--------------------------------------------------------------------------
    | バリデーション言語行
    |--------------------------------------------------------------------------
    */

    'required' => ':attributeを入力してください',
    'email' => ':attributeは「ユーザー名@ドメイン」形式で入力してください',
    'confirmed' => ':attributeが確認用と一致しません',
    'min' => [
        'string' => ':attributeは:min文字以上で入力してください',
        'numeric' => ':attributeは:min以上の数値で入力してください',
    ],
    'max' => [
        'string' => ':attributeは:max文字以内で入力してください',
        'numeric' => ':attributeは:max以下の数値で入力してください',
    ],
    'numeric' => ':attributeは数値で入力してください',
    'unique' => 'この:attributeは既に使われています',

    /*
    |--------------------------------------------------------------------------
    | カスタム属性名
    |--------------------------------------------------------------------------
    */

    'attributes' => [
        'name' => 'お名前',
        'email' => 'メールアドレス',
        'password' => 'パスワード',
        'password_confirmation' => 'パスワード確認',
        'weight' => '現在の体重',
        'target_weight' => '目標体重',
    ],
];
